[
  {
    "id": "63597555a53f726bb72d0edd",
    "name": "Complete Cyber Security Course",
    "picture": "https://i.ibb.co/v3m0BN7/1507697928.jpg",
    "about": "Complete Cyber Security Course. You will learn the fundamentals of cybersecurity and gain experience in the configuration, management, and troubleshooting of common wired and wireless networks with lessons, lectures, and video demonstrations to teach you everything you need to know to pass the CompTIA Security+ exam. An advanced practical skillset in defeating all online threats - advanced hackers, trackers, malware and all Internet nastiness including mitigating government spying and mass surveillance. Start a career in cyber security. Become a cyber security specialist. The very latest up-to-date information and methods. The main element of Cyber Security is the use of authentication mechanisms. For example, a user name identifies an account that a user wants to access, while a password is a mechanism that proves the user is who he claims to be. In this introduction to Cyber Security, you will learn how Cyber Security works, why it’s needed, what Cyber Security experts do to protect data.",
    "category_id": 1,
    "student": 206,
    "language": "English",
    "lastUpdated": "Apr 2022",
    "instructor": "Morrison",
    "Price": 19.99,
    "learnings": [
      "Passing the CompTIA Security+ certification exam with confidence",
      "Become an effective security technician in a business environment",
      "Identify the tools for Cabling a Building or Datacenter",
      "Understand computer security"
    ],
    "requirement": "Basic English and Fundamentals of Computer"
  },
  {
    "id": "635975557fa9cbdf3ea88f13",
    "name": "Information Security Management System",
    "picture": "https://i.ibb.co/0hfDtf0/1-r-Ukey-LH6-F5-Qhhi2q-Kc-Mmxw.jpg",
    "about": "An information security management system (ISMS) represents the collation of all the interrelated/interacting information security elements of an organization so as to ensure policies, procedures, and objectives can be created, implemented, communicated, and evaluated to better guarantee an organization's overall information security. This system is typically influenced by organization's needs, objectives, security requirements, size, and processes. This course doesn’t need any prior knowledge of information security or IT skills. By the end of this course, you will be knowledgeable in information security management system, be more aware of the different areas of information security. Information security management (ISM) defines and manages controls that an organization needs to implement to ensure that it is sensibly protecting the confidentiality, availability, and integrity of assets from threats and vulnerabilities. The core of ISM includes information risk management, a process that involves the assessment of the risks an organization must deal with in the management and protection of assets, as well as the dissemination of the risks to all appropriate stakeholders.",
    "category_id": 1,
    "student": 350,
    "language": "English",
    "lastUpdated": "May 2022",
    "instructor": "Monica",
    "Price": 29.99,
    "learnings": [
      "How To Implement the ISO 27001 in Your Organization",
      "Understand the components for Cabling Implementations",
      "Information Security Management System (ISMS)",
      "Learn the fundamentals of Cabling"
    ],
    "requirement": "Access to Internet"
  },
  {
    "id": "63597555a9ca464980557fd3",
    "name": "Introduction to Cyber Security",
    "picture": "https://i.ibb.co/X2RkYXS/Diploma-in-IT.jpg" ,
    "about": "Cyber Security is a process that’s designed to protect networks and devices from external threats. Businesses typically employ Cyber Security professionals to protect their confidential information, maintain employee productivity, and enhance customer confidence in products and services.Picture an employee at her computer, working with data. In the background, a hacker secretly accesses her company’s confidential files. He steals sensitive information and sells it to criminals, who then hold the company ransom for a profit. It sounds like something out of a movie, but unfortunately, it’s a common occurrence in today’s online landscape. This is why Cyber Security has become such a vital part of any business strategy—and Cyber Security specialists are in demand now more than ever.In this introduction to Cyber Security, you will learn how Cyber Security works, why it’s needed, what Cyber Security experts do to protect data, and how to become one. The main element of Cyber Security is the use of authentication mechanisms. For example, a user name identifies an account that a user wants to access, while a password is a mechanism that proves the user is who he claims to be",
    "category_id": 1,
    "student": 453,
    "language": "English",
    "lastUpdated": "Dec 2021",
    "instructor": "Mcclain",
    "Price": 9.99,
    "learnings": [
      "ISMS - introduction to the key concepts of a information security management system",
      "Understand the components for Cabling Implementations",
      "Understand the purpose and business benefits of an information security management system","Learn the fundamentals of Cabling"
    ],
    "requirement": "Fundamentals of Computer"
  },
  {
    "id": "635975551809e42599e8ccc9",
    "name": "Ethical Hacking From Scratch",
    "picture": "https://i.ibb.co/RHd805S/images-3.jpg" ,
    "about": "Ethical hacking refers to the act of locating weaknesses and vulnerabilities of computer and information systems by duplicating the intent and actions of malicious hackers. Ethical hacking is also known as penetration testing, intrusion testing, or red teaming. An ethical hacker is a security professional who applies their hacking skills for defensive purposes on behalf of the owners of information systems.. This course is highly practical but it won't neglect the theory; we'll start with ethical hacking basics, breakdown the different penetration testing fields and install the needed software (on Windows, Linux and Mac OS X), then we'll dive and start hacking straight away. You'll learn everything by example, by analysing and exploiting different systems such as networks, servers, clients, websites .....etc. We'll never have any boring dry theoretical lectures.Ethical Hacking, also known as penetration testing, intrusion testing, or red teaming, is the controversial act of locating weaknesses and vulnerabilities of computer and information systems by duplicating the intent and actions of malicious hackers.An Ethical Hacker, also known as a whitehat hacker, or simply a whitehat, is a security professional who applies their hacking skills for defensive purposes on behalf of the owners of information systems. Nowadays, certiﬁed ethical hackers are among the most sought after information security employees in large organizations",
    "category_id": 1,
    "student": 63,
    "language": "English",
    "lastUpdated": "Jan 2022",
    "instructor": "Clemons",
    "Price": 99.99,
    "learnings": [
      "Learn the right way to write SQL queries to prevent SQL injections.",
      "Discover MITM & ARP Spoofing attacks.",
      "Discover websites hosted on the same server as the target website.",
      "Discover, exploit & fix SQL injection vulnerabilities."
    ],
    "requirement": "Basic IT Skills"
  },


  
  {
    "id": "6359755527180602b147a97e",
    "name": "Introduction to Computer Networks",
    "picture": "https://i.ibb.co/tPv3HMp/download.jpg" ,
    "about": "Computer Network is a group of computers connected with each other through wires, optical fibres or optical links so that various devices can interact with each other through a network. The aim of the computer network is the sharing of resources among various devices. In the case of computer network technology, there are several types of networks that vary from simple to complex level. NIC is a device that helps the computer to communicate with another device. The network interface card contains the hardware addresses, the data-link layer protocol use this address to identify the system on the network so that it transfers the data to the correct destination. A computer network is a set of computers sharing resources located on or provided by network nodes. The computers use common communication protocols over digital interconnections to communicate with each other. These interconnections are made up of telecommunication network technologies, based on physically wired, optical, and wireless radio-frequency methods that may be arranged in a variety of network topologies. Computer networks may be classified by many criteria, including the transmission medium used to carry signals, bandwidth, communications protocols to organize network traffic, the network size, the topology, traffic control mechanism, and organizational intent.",
    "category_id": 2,
    "student": 61,
    "language": "English",
    "lastUpdated": "Jun 2020",
    "instructor": "Wooten",
    "Price": 9.99,
    "learnings": [
      "Understand How Computer Networks Work",
      "Understand the components for Cabling Implementations",
      "IUnderstand the Benefits of Computer Networks",
      "Know How to Effectively Plan and Design a Computer Network"
    ],
    "requirement": "Basic English and Fundamentals of Computer"
  },
  {
    "id": "63597555cac96bbccc8e96fd",
    "name": "Networking for Effective Backend Design",
    "picture": "https://i.ibb.co/1mHpSft/images-2.jpg",
    "about": "We are entering an era in software engineering where we rely on libraries and frameworks to do most of our work. While this is useful and save tremendous dev hours, it creates leaky abstractions that manifest in form of performance degradation, unexpected errors, 100% CPU , network and disk usage, hangs, latency and many other. It becomes difficult to articulate what goes wrong on the backend and how to fix it when engineers don't understand the basic building block of what they are interacting with.Network planning and design is an iterative process, encompassing topological design, network-synthesis, and network-realization, and is aimed at ensuring that a new telecommunications network or service meets the needs of the subscriber and operator.[1] The process can be tailored according to each new network or service. During the process of Network Planning and Design, estimates are made of the expected traffic intensity and traffic load that the network must support.[1] If a network of a similar nature already exists, traffic measurements of such a network can be used to calculate the exact traffic load.[2] If there are no similar networks, then the network planner must use telecommunications forecasting methods to estimate the expected traffic intensity.",
    "category_id": 2,
    "student": 63,
    "language": "English",
    "lastUpdated": "Nov 2022",
    "instructor": "Wheeler",
    "Price": 10,
    "learnings": [
      "IP Protocol",
      "Understand the performance impact of TCP/IP in Backend applications",
      "Understand the circumstances where requests and responses are slowed down",
      "Learn the fundamentals of Cabling"
    ],
    "requirement": "Recommended: Having built a backend application"
  },
  {
    "id": "6359755555486055ef5cf756",
    "name": "Web Security Testing From Scratch",
    "picture": "https://i.ibb.co/9s25Vn2/free-computer-courses-onlin.jpg",
    "about": "Security testing is a process intended to reveal flaws in the security mechanisms of an information system that protect data and maintain functionality as intended.[1] Due to the logical limitations of security testing, passing the security testing process is not an indication that no flaws exist or that the system adequately satisfies the security requirements. Typical security requirements may include specific elements of confidentiality, integrity, authentication, availability, authorization and non-repudiation.[2] Actual security requirements tested depend on the security requirements implemented by the system. Security testing as a term has a number of different meanings and can be completed in a number of different ways. As such, a Security Taxonomy helps us to understand these different approaches and meanings by providing a base level to work from.This might involve confirming the identity of a person, tracing the origins of an artifact, ensuring that a product is what its packaging and labelling claims to be, or assuring that a computer program is a trusted one.Verification that industry or internal security standards have been applied to system components or product. This is typically completed through gap analysis and utilizes build / code reviews or by reviewing design documents and architecture diagrams. This activity does not utilize any of the earlier approaches (Vulnerability Assessment, Security Assessment, Penetration Test, Security Audit)",
    "category_id": 2,
    "student": 93,
    "language": "English",
    "lastUpdated": "Jun 2022",
    "instructor": "Clemons",
    "Price": 79.99,
    "learnings": [
      "Learn the right way to write SQL queries to prevent SQL injections.",
      "Discover MITM & ARP Spoofing attacks.",
      "Discover websites hosted on the same server as the target website.",
      "Discover, exploit & fix SQL injection vulnerabilities."
    ],
    "requirement": "Basic IT Skills"
  },
  {
    "id": "6359755564f675e45659e43f",
    "name": "AWS Essentials",
    "picture": "https://i.ibb.co/6PtXN8W/what-is-a-network-1-1.jpg",
    "about": "Amazon Web Services, Inc. (AWS) is a subsidiary of Amazon that provides on-demand cloud computing platforms and APIs to individuals, companies, and governments, on a metered pay-as-you-go basis. These cloud computing web services provide distributed computing processing capacity and software tools via AWS server farms. One of these services is Amazon Elastic Compute Cloud (EC2), which allows users to have at their disposal a virtual cluster of computers, available all the time, through the Internet. AWS's virtual computers emulate most of the attributes of a real computer, including hardware central processing units (CPUs) and graphics processing units (GPUs) for processing; local/RAM memory; hard-disk/SSD storage; a choice of operating systems; networking; and pre-loaded application software such as web servers, databases, and customer relationship management (CRM). AWS services are delivered to customers via a network of AWS server farms located throughout the world. Fees are based on a combination of usage, hardware, operating system, software, or networking features chosen by the subscriber required availability, redundancy, security, and service options. Subscribers can pay for a single virtual AWS computer, a dedicated physical computer, or clusters of either.[8] Amazon provides select portions of security for subscribers (e.g. physical security of the data centers) while other aspects of security are the responsibility of the subscriber (e.g. account management, vulnerability scanning, patching). AWS operates from many global geographical regions including 6 in North America.",
    "category_id": 2,
    "student": 63,
    "language": "English",
    "lastUpdated": "Jan 2022",
    "instructor": "Clemons",
    "Price": 99.99,
    "learnings": [
      "Learn the right way to write SQL queries to prevent SQL injections.",
      "Discover MITM & ARP Spoofing attacks.",
      "Discover websites hosted on the same server as the target website.",
      "Discover, exploit & fix SQL injection vulnerabilities."
    ],
    "requirement": "Basic IT Skills"
  },



  {
    "id": "63597555581af3c4ba8f6844",
    "name": "Fundamentals of Artificial Intelligence",
    "picture": "https://i.ibb.co/KrYKqVh/IT-Courses.jpg",
    "about": "Artificial intelligence (AI) is intelligence demonstrated by machines, as opposed to the natural intelligence displayed by animals and humans. AI research has been defined as the field of study of intelligent agents, which refers to any system that perceives its environment and takes actions that maximize its chance of achieving its goals.The term had previously been used to describe machines that mimic and display human cognitive skills that are associated with the human mind, such as learning and problem-solving. This definition has since been rejected by major AI researchers who now describe AI in terms of rationality and acting rationally, which does not limit how intelligence can be articulated. AI applications include advanced web search engines (e.g., Google), recommendation systems (used by YouTube, Amazon and Netflix), understanding human speech (such as Siri and Alexa), self-driving cars (e.g., Tesla), automated decision-making and competing at the highest level in strategic game systems (such as chess and Go).[2] As machines become increasingly capable, tasks considered to require intelligence are often removed from the definition of AI, a phenomenon known as the AI effect. For instance, optical character recognition is frequently excluded from things considered to be AI, having become a routine technology.",
    "category_id": 3,
    "student": 63,
    "language": "English",
    "lastUpdated": "Feb 2022",
    "instructor": "Clemons",
    "Price": 99.99,
    "learnings": [
      "Learn the right way to write SQL queries to prevent SQL injections.",
      "Discover MITM & ARP Spoofing attacks.",
      "Discover websites hosted on the same server as the target website.",
      "Discover, exploit & fix SQL injection vulnerabilities."
    ],
    "requirement": "Basic IT Skills"
  },
  {
    "id": "63597555c798738e5501c50e",
    "name": "Learn How To Build An AI",
    "picture": "https://i.ibb.co/ZTYdktg/01.jpg",
    "about": "The various sub-fields of AI research are centered around particular goals and the use of particular tools. The traditional goals of AI research include reasoning, knowledge representation, planning, learning, natural language processing, perception, and the ability to move and manipulate objects.[c] General intelligence (the ability to solve an arbitrary problem) is among the field's long-term goals.[12] To solve these problems, AI researchers have adapted and integrated a wide range of problem-solving techniques – including search and mathematical optimization, formal logic, artificial neural networks, and methods based on statistics, probability and economics. AI also draws upon computer science, psychology, linguistics, philosophy, and many other fields.The field was founded on the assumption that human intelligence can be so precisely described that a machine can be made to simulate it. This raised philosophical arguments about the mind and the ethical consequences of creating artificial beings endowed with human-like intelligence; these issues have previously been explored by myth, fiction and philosophy since antiquity. Computer scientists and philosophers have since suggested that AI may become an existential risk to humanity if its rational capacities are not steered towards beneficial goals.",
    "category_id": 3,
    "student": 5083,
    "language": "English",
    "lastUpdated": "Mar 2022",
    "instructor": "Clemons",
    "Price": 99.99,
    "learnings": [
      "Learn the right way to write SQL queries to prevent SQL injections.",
      "Discover MITM & ARP Spoofing attacks.",
      "Discover websites hosted on the same server as the target website.",
      "Discover, exploit & fix SQL injection vulnerabilities."
    ],
    "requirement": "Basic IT Skills"
  },
  {
    "id": "635975558e491955574dc35d",
    "name": "Machine Learning & Data Science",
    "picture": "https://i.ibb.co/b1hGdCB/Virtual-management-training-700x467.jpg",
    "about": "In many branches of materials science it is now routine to generate data sets of such large size and dimensionality that conventional methods of analysis fail. Paradigms and tools from data science and machine learning can provide scalable approaches to identify and extract trends and patterns within voluminous data sets, perform guided traversals of high-dimensional phase spaces, and furnish data-driven strategies for inverse materials design. This topical review provides an accessible introduction to machine learning tools in the context of soft and biological materials by 'de-jargonizing' data science terminology, presenting a taxonomy of machine learning techniques, and surveying the mathematical underpinnings and software implementations of popular tools, including principal component analysis, independent component analysis, diffusion maps, support vector machines, and relative entropy. We present illustrative examples of machine learning applications in soft matter, including inverse design of self-assembling materials, nonlinear learning of protein folding landscapes, high-throughput antimicrobial peptide design, and data-driven materials design engines. We close with an outlook on the challenges and opportunities for the field.",
    "category_id": 3,
    "student": 983,
    "language": "English",
    "lastUpdated": "Jul 2020",
    "instructor": "Clemons",
    "Price": 59.99,
    "learnings": [
      "Learn the right way to write SQL queries to prevent SQL injections.",
      "Discover MITM & ARP Spoofing attacks.",
      "Discover websites hosted on the same server as the target website.",
      "Discover, exploit & fix SQL injection vulnerabilities."
    ],
    "requirement": "Basic IT Skills"
  },
  {
    "id": "635980e27f8028cb827ca31b",
    "name": "AI For Business",
    "picture": "https://i.ibb.co/dQqpX59/images.jpg",
    "about": "Companies today have access to more data than ever before. According to Forbes, the amount of data created and consumed increased by 5000% between 2010 and 2020. With the help of emerging technologies, companies are now able to capture user data that can help them make informed business decisions. In the past few years, many companies have wholeheartedly embraced AI in their efforts to make better use of the data they are already collecting.Simply put, artificial intelligence refers to the ability of machines to learn and make decisions based on data and analytics. When used strategically, AI has the potential to make a tremendous difference in the way we go about our work. When you think about artificial intelligence being used by businesses, your mind likely jumps to automation. While some applications of AI do involve automating processes that were originally completed by humans, that only scratches the surface of what AI and machine learning can do. In this guide, we’ll discuss why artificial intelligence is beneficial for businesses and provide some use cases in which AI, machine learning, or big data can be applied.  statistics show that AI is no longer an experimental technology only used by select brands. For many companies around the world, it has become a core part of their operations.",
    "category_id": 3,
    "student": 983,
    "language": "English",
    "lastUpdated": "Jul 2020",
    "instructor": "Clemons",
    "Price": 59.99,
    "learnings": [
      "Learn the right way to write SQL queries to prevent SQL injections.",
      "Discover MITM & ARP Spoofing attacks.",
      "Discover websites hosted on the same server as the target website.",
      "Discover, exploit & fix SQL injection vulnerabilities."
    ],
    "requirement": "Basic IT Skills"
  }
]